---
kind: property
id: P:Autodesk.Revit.DB.GenericForm.Visible
source: html/22be7737-971d-902b-cec3-25d3ae694df0.htm
---
# Autodesk.Revit.DB.GenericForm.Visible Property

The visibility of the GenericForm.

## Syntax (C#)
```csharp
public bool Visible { get; }
```